---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TilePatterns Properties
TilePatterns Class See Also Send Feedback
---

The TilePatterns type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also

TilePatterns Class

Autodesk.Revit.DB Namespace